tutorial/mooringCase/mooredFloatingObject/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;

motionSolverLibs    ("libfiniteVolumeBeamMooring");

motionSolver        sixDoFRigidBodyMotionFvBeam;

sixDoFRigidBodyMotionFvBeamCoeffs
{
    patches         (floatingObject);
    innerDistance   0.05;
    outerDistance   0.45;//0.5 worked up to 5.2s//0.35;

    centreOfMass    (0.0 0.0 -0.016);

    // Cuboid dimensions
    Lx              0.2;
    Ly              0.2;
    Lz              0.132;
    // Density of the solid
    // rhoSolid        131.6666666667;

    // Cuboid mass
    mass           3.144;// #calc "$rhoSolid*$Lx*$Ly*$Lz";

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (0.015 0.015 0.021);
    // momentOfInertia #codeStream
    // {
    //     codeInclude
    //     #{
    //         #include "diagTensor.H"
    //     #};

    //     code
    //     #{
    //         scalar sqrLx = sqr($Lx);
    //         scalar sqrLy = sqr($Ly);
    //         scalar sqrLz = sqr($Lz);
    //         os  <<
    //             $mass
    //            *diagTensor(sqrLy + sqrLz, sqrLx + sqrLz, sqrLx + sqrLy)/12.0;
    //     #};
    // };

    report          on;
    reportToFile    on; // obsolete

    accelerationRelaxation 0.8; // this
    //accelerationDamping 0.9;

    solver
    {
        type FvBeamNewmark;
    }

    constraints
    {
        //translation contrained on a plane around CoR
        fixedPlane
        {
            sixDoFRigidBodyMotionFvBeamConstraint plane;
            normal (0 1 0);
        }

        // rotation constraint
        fixedAxis
        {
            sixDoFRigidBodyMotionFvBeamConstraint axis;
            axis (0 1 0);
        }
    }

    restraints
    {
        beam1
        {
            sixDoFRigidBodyMotionFvBeamRestraint finiteVolumeBeam;

            attachmentPatch	right;

            beamRegion      "beamone";

            refAttachmentPt (-0.1 -0.1 -0.0786);
        }
        beam2
        {
            sixDoFRigidBodyMotionFvBeamRestraint finiteVolumeBeam;

            attachmentPatch	left;

            beamRegion      "beamtwo";

            refAttachmentPt (0.1 -0.1 -0.0786);
        }
        beam3
        {
            sixDoFRigidBodyMotionFvBeamRestraint finiteVolumeBeam;
        
            attachmentPatch	right;
        
            beamRegion      "beamthree";
        
            refAttachmentPt (-0.1 0.1 -0.0786);
        }
        beam4
        {
            sixDoFRigidBodyMotionFvBeamRestraint finiteVolumeBeam;
        
            attachmentPatch	left;
        
            beamRegion      "beamfour";
        
            refAttachmentPt (0.1 0.1 -0.0786);
        }

        
    }
}

// ************************************************************************* //
