tutorial/mooringCase/mooredFloatingObject/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

DebugSwitches
{
    finiteVolumeBeam 1;
}

libs
(
        libfiniteVolumeBeamMooring.dylib
        libsixDoFRigidBodyStateFvBeam.dylib
        libwireBunchingModels.dylib
);


application     interFoam;

startFrom       latestTime; // startTime;

startTime       0;

stopAt          endTime;

endTime         8;

deltaT          0.001;

writeControl    adjustableRunTime; // timeStep; //

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;//binary;

writePrecision  6;

writeCompression no;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.01;

functions
{
//    sixDoF_History
//    {
//        type           sixDoFRigidBodyStateFvBeam;
//        libs           ("libsixDoFRigidBodyStateFvBeam.dylib");
//        angleFormat    radians;//radians, degrees

//        writeControl   writeTime;
//        //writeInterval  5;
//    }

    interfaceHeight1
    {
        type            interfaceHeight;

        libs            ("libfieldFunctionObjects.so");

        locations       ((-2.74 0 0) (-0.05 0 0) (0.07 0 0) (0.55 0 0) (1.9 0 0) (2.9 0 0));
        alpha           alpha.water;

        writeControl   timeStep;
        writeInterval  5;
    }
}

// ************************************************************************* //
